{
  "class_name": "Functional",
  "config": {
    "name": "functional_1",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            128,
            128,
            3
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "image_input"
        },
        "name": "image_input",
        "inbound_nodes": []
      },
      {
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [
              1,
              0
            ],
            [
              1,
              0
            ]
          ],
          "data_format": "channels_last"
        },
        "name": "zero_padding2d",
        "inbound_nodes": [
          [
            [
              "image_input",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d",
          "trainable": true,
          "dtype": "float32",
          "filters": 8,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            2,
            2
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d",
        "inbound_nodes": [
          [
            [
              "zero_padding2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization",
        "inbound_nodes": [
          [
            [
              "conv2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_re_lu",
        "inbound_nodes": [
          [
            [
              "batch_normalization",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_1",
          "trainable": true,
          "dtype": "float32",
          "filters": 8,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_1",
        "inbound_nodes": [
          [
            [
              "leaky_re_lu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_1",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_1",
        "inbound_nodes": [
          [
            [
              "conv2d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_1",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_re_lu_1",
        "inbound_nodes": [
          [
            [
              "batch_normalization_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "DepthwiseConv2D",
        "config": {
          "name": "depthwise_conv2d",
          "trainable": true,
          "dtype": "float32",
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "depthwise_constraint": null
        },
        "name": "depthwise_conv2d",
        "inbound_nodes": [
          [
            [
              "leaky_re_lu_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_2",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_2",
        "inbound_nodes": [
          [
            [
              "depthwise_conv2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_2",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_re_lu_2",
        "inbound_nodes": [
          [
            [
              "batch_normalization_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_2",
          "trainable": true,
          "dtype": "float32",
          "filters": 4,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_2",
        "inbound_nodes": [
          [
            [
              "leaky_re_lu_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_3",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_3",
        "inbound_nodes": [
          [
            [
              "conv2d_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_3",
          "trainable": true,
          "dtype": "float32",
          "filters": 8,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_3",
        "inbound_nodes": [
          [
            [
              "batch_normalization_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_4",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_4",
        "inbound_nodes": [
          [
            [
              "conv2d_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_3",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_re_lu_3",
        "inbound_nodes": [
          [
            [
              "batch_normalization_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "DepthwiseConv2D",
        "config": {
          "name": "depthwise_conv2d_1",
          "trainable": true,
          "dtype": "float32",
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "depthwise_constraint": null
        },
        "name": "depthwise_conv2d_1",
        "inbound_nodes": [
          [
            [
              "leaky_re_lu_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_5",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_5",
        "inbound_nodes": [
          [
            [
              "depthwise_conv2d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_4",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_re_lu_4",
        "inbound_nodes": [
          [
            [
              "batch_normalization_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_4",
          "trainable": true,
          "dtype": "float32",
          "filters": 4,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_4",
        "inbound_nodes": [
          [
            [
              "leaky_re_lu_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_6",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_6",
        "inbound_nodes": [
          [
            [
              "conv2d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.15,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout",
        "inbound_nodes": [
          [
            [
              "batch_normalization_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Add",
        "config": {
          "name": "add",
          "trainable": true,
          "dtype": "float32"
        },
        "name": "add",
        "inbound_nodes": [
          [
            [
              "batch_normalization_3",
              0,
              0,
              {}
            ],
            [
              "dropout",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_5",
          "trainable": true,
          "dtype": "float32",
          "filters": 24,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_5",
        "inbound_nodes": [
          [
            [
              "add",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_7",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_7",
        "inbound_nodes": [
          [
            [
              "conv2d_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_5",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_re_lu_5",
        "inbound_nodes": [
          [
            [
              "batch_normalization_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_1",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [
              1,
              0
            ],
            [
              1,
              0
            ]
          ],
          "data_format": "channels_last"
        },
        "name": "zero_padding2d_1",
        "inbound_nodes": [
          [
            [
              "leaky_re_lu_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "DepthwiseConv2D",
        "config": {
          "name": "depthwise_conv2d_2",
          "trainable": true,
          "dtype": "float32",
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            2,
            2
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "depthwise_constraint": null
        },
        "name": "depthwise_conv2d_2",
        "inbound_nodes": [
          [
            [
              "zero_padding2d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_8",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_8",
        "inbound_nodes": [
          [
            [
              "depthwise_conv2d_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_6",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_re_lu_6",
        "inbound_nodes": [
          [
            [
              "batch_normalization_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_6",
          "trainable": true,
          "dtype": "float32",
          "filters": 8,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_6",
        "inbound_nodes": [
          [
            [
              "leaky_re_lu_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_9",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_9",
        "inbound_nodes": [
          [
            [
              "conv2d_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_7",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_7",
        "inbound_nodes": [
          [
            [
              "batch_normalization_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_10",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_10",
        "inbound_nodes": [
          [
            [
              "conv2d_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_7",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_re_lu_7",
        "inbound_nodes": [
          [
            [
              "batch_normalization_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "DepthwiseConv2D",
        "config": {
          "name": "depthwise_conv2d_3",
          "trainable": true,
          "dtype": "float32",
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "depthwise_constraint": null
        },
        "name": "depthwise_conv2d_3",
        "inbound_nodes": [
          [
            [
              "leaky_re_lu_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_11",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_11",
        "inbound_nodes": [
          [
            [
              "depthwise_conv2d_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_8",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_re_lu_8",
        "inbound_nodes": [
          [
            [
              "batch_normalization_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_8",
          "trainable": true,
          "dtype": "float32",
          "filters": 8,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_8",
        "inbound_nodes": [
          [
            [
              "leaky_re_lu_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_12",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_12",
        "inbound_nodes": [
          [
            [
              "conv2d_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_1",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.15,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_1",
        "inbound_nodes": [
          [
            [
              "batch_normalization_12",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Add",
        "config": {
          "name": "add_1",
          "trainable": true,
          "dtype": "float32"
        },
        "name": "add_1",
        "inbound_nodes": [
          [
            [
              "batch_normalization_9",
              0,
              0,
              {}
            ],
            [
              "dropout_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_9",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_9",
        "inbound_nodes": [
          [
            [
              "add_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_13",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_13",
        "inbound_nodes": [
          [
            [
              "conv2d_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_9",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_re_lu_9",
        "inbound_nodes": [
          [
            [
              "batch_normalization_13",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "DepthwiseConv2D",
        "config": {
          "name": "depthwise_conv2d_4",
          "trainable": true,
          "dtype": "float32",
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "depthwise_constraint": null
        },
        "name": "depthwise_conv2d_4",
        "inbound_nodes": [
          [
            [
              "leaky_re_lu_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_14",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_14",
        "inbound_nodes": [
          [
            [
              "depthwise_conv2d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_10",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_re_lu_10",
        "inbound_nodes": [
          [
            [
              "batch_normalization_14",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_10",
          "trainable": true,
          "dtype": "float32",
          "filters": 8,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_10",
        "inbound_nodes": [
          [
            [
              "leaky_re_lu_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_15",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_15",
        "inbound_nodes": [
          [
            [
              "conv2d_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_2",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.15,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_2",
        "inbound_nodes": [
          [
            [
              "batch_normalization_15",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Add",
        "config": {
          "name": "add_2",
          "trainable": true,
          "dtype": "float32"
        },
        "name": "add_2",
        "inbound_nodes": [
          [
            [
              "add_1",
              0,
              0,
              {}
            ],
            [
              "dropout_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_11",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.0005000000237487257
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_11",
        "inbound_nodes": [
          [
            [
              "add_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_16",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
